In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01', 'col02','col03'],
                 index=['index01','index02','index03'])
df

         col01  col02  col03
index01      1      2      3
index02      4      5      6
index03      7      8      9

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                 columns=['col01', 'col02','col03'],
                 index=['index01','index02','index03'])
df

         col01  col02  col03
index01      1      2      3
index02      4      5      6
index03      7      8      9

In [5]:
df.index

Index(['index01', 'index02', 'index03'], dtype='object')

In [6]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [7]:
df = pd.DataFrame({'col01': [1,2,3],
                  'col02': [4,5,6],
                  'col03': [7,8,9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [11]:
df = pd.DataFrame({'col01': [1,2,3],
                  'col02': [4,5,6],
                  'col03': [7,8,9]})
df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [12]:
df = pd.DataFrame({'col01': [1,2,3],
                  'col02': [4,5,6],
                  'col03': [7,8,9]},
                    index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [14]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
df.columns = ['col01','col02','col03']
df

   col01  col02  col03
0      1      2      3
1      4      5      6
2      7      8      9

In [20]:
df.index = ['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [21]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [22]:
df.columns = ['col04','col05','col06']
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [24]:
df = df.rename(columns={'col04': 'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [25]:
df = df.rename(columns={'col04': 'x', 'col05': 'y'})
df

       x  y  col06
idx01  1  2      3
idx02  4  5      6
idx03  7  8      9

In [29]:
df = df.rename(index={'idx01': 'w'})
df

       x  y  col06
w      1  2      3
idx02  4  5      6
idx03  7  8      9

In [30]:
df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [31]:
type(df['x'])

pandas.core.series.Series

In [32]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [35]:
type(df[['x']])

pandas.core.frame.DataFrame

In [37]:
df.loc[:,'x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [38]:
df.iloc[:,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [39]:
df = pd.DataFrame({'col01': [1,2,3],
                  'col02': [4,5,6],
                  'col03': [7,8,9]},
                    index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [41]:
df.loc['idx03','col02']

6

In [42]:
df.loc['idx03', 'col02']=100
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3    100      9

In [44]:
df.loc[:, 'col03']=['Tokyo','Osaka', 'Hokkaido']
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03      3    100  Hokkaido

In [45]:
df.loc[:, 'col02': 'col03']

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [46]:
df.iloc[:,1:3]

       col02     col03
idx01      4     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [47]:
df.index.get_loc('idx03')

2

In [48]:
df.columns.get_loc('col02')

1

In [50]:
df.iloc[df.index.get_loc('idx03'), df.columns.get_loc('col02')]=1000
df

       col01  col02     col03
idx01      1      4     Tokyo
idx02      2      5     Osaka
idx03      3   1000  Hokkaido

In [51]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [52]:
df.shape

(3, 3)

In [53]:
df.T

       idx01  idx02     idx03
col01      1      2         3
col02      4      5      1000
col03  Tokyo  Osaka  Hokkaido

In [54]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03': [7,8,9]}
                    ,index = ['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [56]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [58]:
df = df.rename(index={'idx03': 'idx04'})

In [59]:
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx04      3      6      9

In [60]:
df['col01']

idx01    1
idx02    2
idx04    3
Name: col01, dtype: int64

In [64]:
df.iloc[:, 1]

idx01    4
idx02    5
idx04    6
Name: col02, dtype: int64

In [65]:
df.loc[:,'col01':'col02']

       col01  col02
idx01      1      4
idx02      2      5
idx04      3      6

In [66]:
df.dtypes

col01    int64
col02    int64
col03    int64
dtype: object

In [3]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03': [7,8,9]}
                    ,index = ['idx01', 'idx02', 'idx03'])
df

NameError: name 'pd' is not defined

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03': [7,8,9]}
                    ,index = ['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [6]:
df.shape

(3, 3)

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03': [7,8,9]}
                    ,index = ['idx01', 'idx02', 'idx03'])

In [5]:
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6]})

In [5]:
df

   col01  col02
0      1      4
1      2      5
2      3      6

In [6]:
df = index = ['index01', 'index02', 'index03']

In [7]:
df

['index01', 'index02', 'index03']

In [8]:
df

['index01', 'index02', 'index03']

In [10]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03':[7,8,9]})

In [11]:
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [12]:
df = pd.DataFrame(['index01', 'index02', 'index03'])

In [13]:
df

         0
0  index01
1  index02
2  index03

In [14]:
df = index = ['index01', 'index02', 'index03']

In [15]:
df

['index01', 'index02', 'index03']

In [16]:
df = pd.DataFrame({'col01': [1,2,3], 'col02': [4,5,6], 'col03':[7,8,9]})

In [17]:
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([1,2,3])

In [4]:
df

   0
0  1
1  2
2  3

In [6]:
df = pd.DataFrame([[1,2,3],[4,5,6]])

In [7]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
index = ['idx01', 'idx02', 'idx03']

In [9]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [10]:
index

['idx01', 'idx02', 'idx03']

In [1]:
print(1+2)

3

In [3]:
class Student:
  def __init__(self,name):
      self.name = name

  def calculate_avg(self,data):
    sum = 0
    for num in data:
      sum += num

    avg =sum/len(data)
    return avg

  def jedge(self,avg):

    if(avg >= 60):
      result = "passed"
    else:
      result = "failed"
    return result

a001 = Student("sato")
data = [70, 65, 50, 90, 30]
avg = a001.calculate_avg(data)
result = a001.jedge(avg)

print(avg)
print(a001.name+" "+result)

61.0
sato passed

##

In [4]:
print('hello!')

hello!

In [5]:
s001 = Student("kano")

In [6]:
print(s001.name)

kano

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [9]:
import numpy as np

In [11]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [12]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [13]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [14]:
df = pd.DataFrame({'col01':[1,2,3],
                 'col02':[4,5,6],
                 'col03':[7,8,9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [15]:
df.index = ['idx01', 'idx02', 'idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [17]:
df = pd.DataFrame({'col01':[1,2,3],
                  'col02':[4,5,6]},
                 index = ['idx01','idx02','idx03'])
df

       col01  col02
idx01      1      4
idx02      2      5
idx03      3      6

In [18]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
df.columns = ['col01','col02','col03']
df.index = ['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [20]:
df.columns = ['col04','col05','col06']

In [21]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [23]:
df = df.rename(columns={'col04':'x'})

In [24]:
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [26]:
df = df.rename(columns={'col05': 'y','col06': 'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [28]:
df = df.rename(index={'idx01': 'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [29]:
df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [30]:
type(df['x'])

pandas.core.series.Series

In [31]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [32]:
type(df[['x']])

pandas.core.frame.DataFrame

In [33]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [35]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [36]:
df.loc['idx02','y']

5

In [38]:
df.loc[:,'x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [40]:
df.iloc[:,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [42]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [43]:
df.loc['idx01','col02']

2

In [45]:
df.loc['idx03', 'col02']=100

In [46]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [48]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [51]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [52]:
df.iloc[:,1:3]

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [54]:
df.index.get_loc('idx03')

2

In [55]:
df.columns.get_loc('col02')

1

In [56]:
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [57]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [58]:
df.shape

(3, 3)

In [59]:
df.T

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido

## 5series

In [60]:
import pandas as pd

In [61]:
s1 = pd.Series([90,78,65,87,72])
s1

0    90
1    78
2    65
3    87
4    72
dtype: int64

In [62]:
data = [90, 78, 65, 87, 72]

In [63]:
s1 = pd.Series(data)
s1

0    90
1    78
2    65
3    87
4    72
dtype: int64

In [64]:
import numpy as np

In [65]:
np.arange(1, 10, 2)

array([1, 3, 5, 7, 9])

In [66]:
s2 = pd.Series(np.arange(1,10,2))
s2

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [67]:
data = np.arange(1,10,2)

In [68]:
s2 = pd.Series(data)

In [69]:
s2

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [70]:
s1.dtypes

dtype('int64')

In [71]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [72]:
s1.index = ['sato','suzuki','takahashi','tanaka','ito']

In [73]:
s1

sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
dtype: int64

In [75]:
dict01 = {'sato':90, 'suzuki':78, 'takahashi':65, 'tanaka':87, 'ito':72}

In [78]:
s3 = pd.Series(dict01)
s3

sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
dtype: int64

In [79]:
s1.values

array([90, 78, 65, 87, 72])

In [81]:
s1['suzuki']

78

In [82]:
s1[1]

78

In [84]:
s1[['suzuki', 'tanaka']]

suzuki    78
tanaka    87
dtype: int64

In [85]:
s1[[1,3]]

suzuki    78
tanaka    87
dtype: int64

In [86]:
s1 > 80

sato          True
suzuki       False
takahashi    False
tanaka        True
ito          False
dtype: bool

In [87]:
s1[s1 > 80]

sato      90
tanaka    87
dtype: int64

In [89]:
s1[s1 <= 80]

suzuki       78
takahashi    65
ito          72
dtype: int64

In [91]:
s1.size

5

In [92]:
len(s1)

5

In [93]:
s1.index.name = 'member'

In [94]:
s1

member
sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
dtype: int64

In [95]:
s1.name = 'score'
s1

member
sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
Name: score, dtype: int64

In [96]:
s1 + 2

member
sato         92
suzuki       80
takahashi    67
tanaka       89
ito          74
Name: score, dtype: int64

In [97]:
s1 - 2

member
sato         88
suzuki       76
takahashi    63
tanaka       85
ito          70
Name: score, dtype: int64

In [98]:
s1 * 2

member
sato         180
suzuki       156
takahashi    130
tanaka       174
ito          144
Name: score, dtype: int64

In [99]:
s1 / 2

member
sato         45.0
suzuki       39.0
takahashi    32.5
tanaka       43.5
ito          36.0
Name: score, dtype: float64

In [100]:
s5 = pd.Series(['test'])
s5

0    test
dtype: object

In [101]:
s5 + 2

TypeError: can only concatenate str (not "int") to str

In [102]:
s2

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [103]:
s2.index = ['suzuki', 'takahashi', 'tanaka', 'ito', 'watanabe']
s2

suzuki       1
takahashi    3
tanaka       5
ito          7
watanabe     9
dtype: int64

In [104]:
s1

member
sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
Name: score, dtype: int64

In [105]:
s1 + s2

ito          79.0
sato          NaN
suzuki       79.0
takahashi    68.0
tanaka       92.0
watanabe      NaN
dtype: float64

In [106]:
s1

member
sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
Name: score, dtype: int64

In [108]:
s1.hasnans

False

In [109]:
s4 = pd.Series([90, 78, 65, None, 72])
s4

0    90.0
1    78.0
2    65.0
3     NaN
4    72.0
dtype: float64

In [110]:
s4.hasnans

True

In [111]:
pd.isnull(s4)

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [113]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]],
                 columns=['col01', 'col02', 'col03'],
                 index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [114]:
df['col01']

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [115]:
type(df['col01'])

pandas.core.series.Series

In [118]:
s5 = pd.Series({'idx01':10, 'idx02':11, 'idx03':12})
s5

idx01    10
idx02    11
idx03    12
dtype: int64

In [122]:
df['col04'] = s5
df

       col01  col02  col03  col04
idx01      1      2      3     10
idx02      4      5      6     11
idx03      7      8      9     12

In [123]:
s6 = pd.Series({'idx03':13, 'idx04':14, 'idx05':15})
s6

idx03    13
idx04    14
idx05    15
dtype: int64

In [124]:
df['col05'] = s6
df

       col01  col02  col03  col04  col05
idx01      1      2      3     10    NaN
idx02      4      5      6     11    NaN
idx03      7      8      9     12   13.0

In [126]:
dates = pd.date_range('2000/01/01', periods = 5, freq = 'D')
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05'],
              dtype='datetime64[ns]', freq='D')

In [127]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [128]:
s1

member
sato         90
suzuki       78
takahashi    65
tanaka       87
ito          72
Name: score, dtype: int64

In [129]:
s1.index = dates
s1

2000-01-01    90
2000-01-02    78
2000-01-03    65
2000-01-04    87
2000-01-05    72
Freq: D, Name: score, dtype: int64

## 06

In [130]:
import pandas as pd

In [131]:
pd.set_option('display.max_rows', 10)

In [135]:
df_csv = pd.read_csv('data.csv', encoding = 'shift-jis')
df_csv

0          1         9.0  1920.0  2359183  1244322  1114861
1          2         9.0  1920.0   756454   381293   375161
2          3         9.0  1920.0   845540   421069   424471
3          4         9.0  1920.0   961768   485309   476459
4          5         9.0  1920.0   898537   453682   444855
..       ...   ...  ..    ...     ...      ...      ...      ...
934       43        27.0  2015.0  1786170   841046   945124
935       44        27.0  2015.0  1166338   551932   614406
936       45        27.0  2015.0  1104069   519242   584827
937       46       27.0  2015.0  1648177   773061   875116
938       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [137]:
df_csv = pd.read_csv('data01.csv', encoding = 'shift-jis', names = ['area_code', 'area','GG', 'gg', 'yyyy', 'population', 'man', 'woman'])
df_csv

     area_code  area  GG  gg  yyyy  population      man    woman
0            1        9  1920     2359183  1244322  1114861
1            2        9  1920      756454   381293   375161
2            3        9  1920      845540   421069   424471
3            4        9  1920      961768   485309   476459
4            5        9  1920      898537   453682   444855
..         ...   ...  ..  ..   ...         ...      ...      ...
934         43       27  2015     1786170   841046   945124
935         44       27  2015     1166338   551932   614406
936         45       27  2015     1104069   519242   584827
937         46      27  2015     1648177   773061   875116
938         47       27  2015     1433566   704619   728947

[939 rows x 8 columns]

In [138]:
df_csv = pd.read_csv('data.csv', encoding = 'shift-jis', index_col = 1)
df_csv

          1      9.0  1920.0  2359183  1244322  1114861
          2      9.0  1920.0   756454   381293   375161
          3      9.0  1920.0   845540   421069   424471
          4      9.0  1920.0   961768   485309   476459
          5      9.0  1920.0   898537   453682   444855
...        ...  ..    ...     ...      ...      ...      ...
         43     27.0  2015.0  1786170   841046   945124
         44     27.0  2015.0  1166338   551932   614406
         45     27.0  2015.0  1104069   519242   584827
        46     27.0  2015.0  1648177   773061   875116
         47     27.0  2015.0  1433566   704619   728947

[939 rows x 7 columns]

In [140]:
type(df_csv.index)

pandas.core.indexes.base.Index

In [141]:
df_csv.dtypes

      int64
          object
      float64
      float64
       int64
        int64
        int64
dtype: object

In [150]:
df_csv = pd.read_csv('data.csv', encoding = 'shift-jis', index_col = [0,1,2,3,4])
df_csv

1           9.0   1920.0  2359183  1244322  1114861
2           9.0   1920.0   756454   381293   375161
3           9.0   1920.0   845540   421069   424471
4           9.0   1920.0   961768   485309   476459
5           9.0   1920.0   898537   453682   444855
...                                ...      ...      ...
43          27.0  2015.0  1786170   841046   945124
44          27.0  2015.0  1166338   551932   614406
45          27.0  2015.0  1104069   519242   584827
46         27.0  2015.0  1648177   773061   875116
47          27.0  2015.0  1433566   704619   728947

[939 rows x 3 columns]

In [151]:
df_csv = pd.read_csv('data.csv', encoding = 'shift-jis', index_col = [0,1,2,3,4])
df_csv

1           9.0   1920.0  2359183  1244322  1114861
2           9.0   1920.0   756454   381293   375161
3           9.0   1920.0   845540   421069   424471
4           9.0   1920.0   961768   485309   476459
5           9.0   1920.0   898537   453682   444855
...                                ...      ...      ...
43          27.0  2015.0  1786170   841046   945124
44          27.0  2015.0  1166338   551932   614406
45          27.0  2015.0  1104069   519242   584827
46         27.0  2015.0  1648177   773061   875116
47          27.0  2015.0  1433566   704619   728947

[939 rows x 3 columns]

In [152]:
type(df_csv.index)

pandas.core.indexes.multi.MultiIndex

In [153]:
df_csv.dtypes

    int64
     int64
     int64
dtype: object

In [154]:
df_csv.to_csv('data_csv.csv', encoding = 'shift-jis')

In [155]:
pd.read_excel('data.xlsx')

0          1           9   1920  2359183  1244322  1114861
1          2           9   1920   756454   381293   375161
2          3           9   1920   845540   421069   424471
3          4           9   1920   961768   485309   476459
4          5           9   1920   898537   453682   444855
..       ...   ...  ..    ...    ...      ...      ...      ...
934       43          27   2015  1786170   841046   945124
935       44          27   2015  1166338   551932   614406
936       45          27   2015  1104069   519242   584827
937       46         27   2015  1648177   773061   875116
938       47          27   2015  1433566   704619   728947

[939 rows x 8 columns]

In [156]:
pd.read_excel('data01.xlsx')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,,,,,,,,
2,1,,,9,1920,2359183,1244322,1114861
3,2,,,9,1920,756454,381293,375161
4,3,,,9,1920,845540,421069,424471
...,...,...,...,...,...,...,...,...
936,43,,,27,2015,1786170,841046,945124
937,44,,,27,2015,1166338,551932,614406
938,45,,,27,2015,1104069,519242,584827
939,46,,,27,2015,1648177,773061,875116
940,47,,,27,2015,1433566,704619,728947

In [157]:
pd.read_excel('data01.xlsx', skiprows = 2)

0          1           9   1920  2359183  1244322  1114861
1          2           9   1920   756454   381293   375161
2          3           9   1920   845540   421069   424471
3          4           9   1920   961768   485309   476459
4          5           9   1920   898537   453682   444855
..       ...   ...  ..    ...    ...      ...      ...      ...
934       43          27   2015  1786170   841046   945124
935       44          27   2015  1166338   551932   614406
936       45          27   2015  1104069   519242   584827
937       46         27   2015  1648177   773061   875116
938       47          27   2015  1433566   704619   728947

[939 rows x 8 columns]

In [158]:
pd.read_excel('data01.xlsx', skiprows = 2, header = [0])

0          1           9   1920  2359183  1244322  1114861
1          2           9   1920   756454   381293   375161
2          3           9   1920   845540   421069   424471
3          4           9   1920   961768   485309   476459
4          5           9   1920   898537   453682   444855
..       ...   ...  ..    ...    ...      ...      ...      ...
934       43          27   2015  1786170   841046   945124
935       44          27   2015  1166338   551932   614406
936       45          27   2015  1104069   519242   584827
937       46         27   2015  1648177   773061   875116
938       47          27   2015  1433566   704619   728947

[939 rows x 8 columns]

In [159]:
pd.read_excel('data01.xlsx', skiprows = 2, header = [1])

      1        9  1920  2359183  1244322  1114861
0     2        9  1920   756454   381293   375161
1     3        9  1920   845540   421069   424471
2     4        9  1920   961768   485309   476459
3     5        9  1920   898537   453682   444855
4     6        9  1920   968925   478328   490597
..   ..   ...  ..  ..   ...      ...      ...      ...
933  43       27  2015  1786170   841046   945124
934  44       27  2015  1166338   551932   614406
935  45       27  2015  1104069   519242   584827
936  46      27  2015  1648177   773061   875116
937  47       27  2015  1433566   704619   728947

[938 rows x 8 columns]

In [161]:
pd.read_excel('data02.xlsx', header = None)

      0     1   2   3     4        5        6        7
0     1        9  1920  2359183  1244322  1114861
1     2        9  1920   756454   381293   375161
2     3        9  1920   845540   421069   424471
3     4        9  1920   961768   485309   476459
4     5        9  1920   898537   453682   444855
..   ..   ...  ..  ..   ...      ...      ...      ...
934  43       27  2015  1786170   841046   945124
935  44       27  2015  1166338   551932   614406
936  45       27  2015  1104069   519242   584827
937  46      27  2015  1648177   773061   875116
938  47       27  2015  1433566   704619   728947

[939 rows x 8 columns]

In [162]:
pd.read_excel('data03.xlsx', header = [0,1])

             () (mm) () (mm) () (mm)
0      2019/1/1     6.8        0.0     2.0        0.0    -4.7        0.0
1      2019/1/2     7.3        0.0     3.9        0.0    -6.9        0.0
2      2019/1/3     6.1        0.0     2.3        0.0    -7.4        0.0
3      2019/1/4     6.5        0.0     2.2        0.0    -2.6        0.0
4      2019/1/5     8.3        0.0     6.2        0.0    -3.3        4.5
..          ...     ...        ...     ...        ...     ...        ...
361  2019/12/28     7.9        0.0     4.6        0.0    -6.4        0.0
362  2019/12/29     8.2        0.0     5.3        0.0    -7.2        0.0
363  2019/12/30     8.3        0.0     5.2        8.0    -0.6        9.5
364  2019/12/31     9.2        0.0     8.4        0.0    -0.4        2.0
365    2020/1/1     6.7        0.0     2.9        0.0    -5.4        0.0

[366 rows x 7 columns]

In [163]:
pd.read_excel('data.xlsx')

0          1           9   1920  2359183  1244322  1114861
1          2           9   1920   756454   381293   375161
2          3           9   1920   845540   421069   424471
3          4           9   1920   961768   485309   476459
4          5           9   1920   898537   453682   444855
..       ...   ...  ..    ...    ...      ...      ...      ...
934       43          27   2015  1786170   841046   945124
935       44          27   2015  1166338   551932   614406
936       45          27   2015  1104069   519242   584827
937       46         27   2015  1648177   773061   875116
938       47          27   2015  1433566   704619   728947

[939 rows x 8 columns]

In [165]:
pd.read_excel('data.xlsx',index_col = 0)

1                 9   1920  2359183  1244322  1114861
2                 9   1920   756454   381293   375161
3                 9   1920   845540   421069   424471
4                 9   1920   961768   485309   476459
5                 9   1920   898537   453682   444855
...       ...  ..    ...    ...      ...      ...      ...
43               27   2015  1786170   841046   945124
44               27   2015  1166338   551932   614406
45               27   2015  1104069   519242   584827
46              27   2015  1648177   773061   875116
47               27   2015  1433566   704619   728947

[939 rows x 7 columns]

In [166]:
pd.read_excel('data.xlsx', index_col = '')

1                 9   1920  2359183  1244322  1114861
2                 9   1920   756454   381293   375161
3                 9   1920   845540   421069   424471
4                 9   1920   961768   485309   476459
5                 9   1920   898537   453682   444855
...       ...  ..    ...    ...      ...      ...      ...
43               27   2015  1786170   841046   945124
44               27   2015  1166338   551932   614406
45               27   2015  1104069   519242   584827
46              27   2015  1648177   773061   875116
47               27   2015  1433566   704619   728947

[939 rows x 7 columns]

In [167]:
df_excel = pd.read_excel('data03.xlsx')
df_excel

                            .1               .1               .1
0             ()  (mm)  ()  (mm)  ()  (mm)
1      2019/1/1      6.8           0        2           0     -4.7           0
2      2019/1/2      7.3           0      3.9           0     -6.9           0
3      2019/1/3      6.1           0      2.3           0     -7.4           0
4      2019/1/4      6.5           0      2.2           0     -2.6           0
..          ...      ...         ...      ...         ...      ...         ...
362  2019/12/28      7.9           0      4.6           0     -6.4           0
363  2019/12/29      8.2           0      5.3           0     -7.2           0
364  2019/12/30      8.3           0      5.2           8     -0.6         9.5
365  2019/12/31      9.2           0      8.4           0     -0.4           2
366    2020/1/1      6.7           0      2.9           0     -5.4           0

[367 rows x 7 columns]

In [168]:
df_excel = pd.read_excel('data03.xlsx', skiprows = 1, index_col = '')
df_excel

,(),(mm),().1,(mm).1,().2,(mm).2
,,,,,,
2019/1/1,6.8,0.0,2.0,0.0,-4.7,0.0
2019/1/2,7.3,0.0,3.9,0.0,-6.9,0.0
2019/1/3,6.1,0.0,2.3,0.0,-7.4,0.0
2019/1/4,6.5,0.0,2.2,0.0,-2.6,0.0
2019/1/5,8.3,0.0,6.2,0.0,-3.3,4.5
...,...,...,...,...,...,...
2019/12/28,7.9,0.0,4.6,0.0,-6.4,0.0
2019/12/29,8.2,0.0,5.3,0.0,-7.2,0.0
2019/12/30,8.3,0.0,5.2,8.0,-0.6,9.5
2019/12/31,9.2,0.0,8.4,0.0,-0.4,2.0
2020/1/1,6.7,0.0,2.9,0.0,-5.4,0.0

In [169]:
type(df_excel.index)

pandas.core.indexes.base.Index

In [170]:
df_excel = pd.read_excel('data03.xlsx', skiprows = 1, index_col = '', parse_dates = True)
df_excel

,(),(mm),().1,(mm).1,().2,(mm).2
,,,,,,
2019-01-01,6.8,0.0,2.0,0.0,-4.7,0.0
2019-01-02,7.3,0.0,3.9,0.0,-6.9,0.0
2019-01-03,6.1,0.0,2.3,0.0,-7.4,0.0
2019-01-04,6.5,0.0,2.2,0.0,-2.6,0.0
2019-01-05,8.3,0.0,6.2,0.0,-3.3,4.5
...,...,...,...,...,...,...
2019-12-28,7.9,0.0,4.6,0.0,-6.4,0.0
2019-12-29,8.2,0.0,5.3,0.0,-7.2,0.0
2019-12-30,8.3,0.0,5.2,8.0,-0.6,9.5
2019-12-31,9.2,0.0,8.4,0.0,-0.4,2.0
2020-01-01,6.7,0.0,2.9,0.0,-5.4,0.0

In [171]:
type(df_excel.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [172]:
df_excel.to_excel('df_excel.xlsx')

In [173]:
df_cb = pd.read_clipboard()

In [174]:
df_cb

0        1           9   1920  2359183  1244322  1114861
1        2           9   1920   756454   381293   375161
2        3           9   1920   845540   421069   424471
3        4           9   1920   961768   485309   476459
4        5           9   1920   898537   453682   444855
5        6           9   1920   968925   478328   490597
6        7           9   1920  1362750   673525   689225
7        8           9   1920  1350400   662128   688272
8        9           9   1920  1046479   514255   532224
9       10           9   1920  1052610   514106   538504

In [175]:
import sqlite3

In [176]:
df_csv = pd.read_csv('data.csv', encoding = 'shift-jis')
df_csv

0          1         9.0  1920.0  2359183  1244322  1114861
1          2         9.0  1920.0   756454   381293   375161
2          3         9.0  1920.0   845540   421069   424471
3          4         9.0  1920.0   961768   485309   476459
4          5         9.0  1920.0   898537   453682   444855
..       ...   ...  ..    ...     ...      ...      ...      ...
934       43        27.0  2015.0  1786170   841046   945124
935       44        27.0  2015.0  1166338   551932   614406
936       45        27.0  2015.0  1104069   519242   584827
937       46       27.0  2015.0  1648177   773061   875116
938       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [179]:
dbname = 'TEST.db'
conn = sqlite3.connect(dbname)
conn.close()

In [180]:
conn = sqlite3.connect(dbname)

df_csv.to_sql('test_table', conn, if_exists = 'replace')

conn.close()

In [181]:
conn = sqlite3.connect(dbname)

df_db = pd.read_sql('SELECT * FROM test_table', conn)

conn.close()

In [182]:
df_db

     index
0        0        1         9.0  1920.0  2359183  1244322  1114861
1        1        2         9.0  1920.0   756454   381293   375161
2        2        3         9.0  1920.0   845540   421069   424471
3        3        4         9.0  1920.0   961768   485309   476459
4        4        5         9.0  1920.0   898537   453682   444855
..     ...      ...   ...  ..    ...     ...      ...      ...      ...
934    934       43        27.0  2015.0  1786170   841046   945124
935    935       44        27.0  2015.0  1166338   551932   614406
936    936       45        27.0  2015.0  1104069   519242   584827
937    937       46       27.0  2015.0  1648177   773061   875116
938    938       47        27.0  2015.0  1433566   704619   728947

[939 rows x 9 columns]

In [185]:
sql = '''
select *
from test_table
where  == ""
'''

In [187]:
conn = sqlite3.connect(dbname)

df_db = pd.read_sql(sql, conn)

conn.close()

In [188]:
df_db

    index
0      12       13         9.0  1920.0   3699428  1952989  1746439
1      59       13        14.0  1925.0   4485144  2387609  2097535
2     106       13         5.0  1930.0   5408678  2855323  2553355
3     153       13        10.0  1935.0   6369919  3325696  3044223
4     200       13        15.0  1940.0   7354971  3795875  3559096
..    ...      ...   ...  ..    ...     ...       ...      ...      ...
15    716       13         7.0  1995.0  11773605  5892704  5880901
16    763       13        12.0  2000.0  12064101  6028562  6035539
17    810       13        17.0  2005.0  12576601  6264895  6311706
18    857       13        22.0  2010.0  13159388  6512110  6647278
19    904       13        27.0  2015.0  13515271  6666690  6848581

[20 rows x 9 columns]

In [189]:
conn = sqlite3.connect(dbname)

for i in range(1000):
    df_csv.to_sql('test_table_1000',conn,if_exists ='append')

conn.close()

In [190]:
sql = '''
select count(*) as cnt
from test_table_1000
'''

In [191]:
conn = sqlite3.connect(dbname)

df_db = pd.read_sql(sql, conn)

conn.close()

In [192]:
df_db

      cnt
0  939000

In [195]:
sql = '''
select *
from test_table_1000
where  == "" and  =="1920.0"
'''

In [196]:
conn = sqlite3.connect(dbname)

df_db = pd.read_sql(sql, conn)

conn.close()

In [197]:
df_db

     index
0       12       13         9.0  1920.0  3699428  1952989  1746439
1       12       13         9.0  1920.0  3699428  1952989  1746439
2       12       13         9.0  1920.0  3699428  1952989  1746439
3       12       13         9.0  1920.0  3699428  1952989  1746439
4       12       13         9.0  1920.0  3699428  1952989  1746439
..     ...      ...   ...  ..    ...     ...      ...      ...      ...
995     12       13         9.0  1920.0  3699428  1952989  1746439
996     12       13         9.0  1920.0  3699428  1952989  1746439
997     12       13         9.0  1920.0  3699428  1952989  1746439
998     12       13         9.0  1920.0  3699428  1952989  1746439
999     12       13         9.0  1920.0  3699428  1952989  1746439

[1000 rows x 9 columns]

## 07 DataFrame

In [1]:
import pandas as pd

In [2]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 5)

In [3]:
df = pd.read_csv('data.csv', encoding = 'shift-jis')
print(df)

0          1         9.0  1920.0  2359183  1244322  1114861
1          2         9.0  1920.0   756454   381293   375161
..       ...   ...  ..    ...     ...      ...      ...      ...
937       46       27.0  2015.0  1648177   773061   875116
938       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [4]:
df

0          1         9.0  1920.0  2359183  1244322  1114861
1          2         9.0  1920.0   756454   381293   375161
..       ...   ...  ..    ...     ...      ...      ...      ...
937       46       27.0  2015.0  1648177   773061   875116
938       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [5]:
df.index += 1

In [6]:
df

1          1         9.0  1920.0  2359183  1244322  1114861
2          2         9.0  1920.0   756454   381293   375161
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [7]:
df[0:3]

1        1         9.0  1920.0  2359183  1244322  1114861
2        2         9.0  1920.0   756454   381293   375161
3        3         9.0  1920.0   845540   421069   424471

In [8]:
df[:3]

1        1         9.0  1920.0  2359183  1244322  1114861
2        2         9.0  1920.0   756454   381293   375161
3        3         9.0  1920.0   845540   421069   424471

In [9]:
df[9:14]

10       10         9.0  1920.0  1052610   514106   538504
11       11         9.0  1920.0  1319533   641161   678372
12       12         9.0  1920.0  1336155   656968   679187
13       13         9.0  1920.0  3699428  1952989  1746439
14       14        9.0  1920.0  1323390   689751   633639

In [10]:
df[100:105]

101        7         5.0  1930.0  1508150  742342  765808
102        8         5.0  1930.0  1487097  734059  753038
103        9         5.0  1930.0  1141737  562839  578898
104       10         5.0  1930.0  1186080  581007  605073
105       11         5.0  1930.0  1459172  718779  740393

In [11]:
df[''][:5]

1    2359183
2     756454
3     845540
4     961768
5     898537
Name: , dtype: int64

In [14]:
df[['']][:5]

1  2359183
2   756454
3   845540
4   961768
5   898537

In [15]:
df[['', '']][:5]

1     2359183
2      756454
3      845540
4      961768
5      898537

In [16]:
df[''] == 2015

1      False
2      False
       ...
938     True
939     True
Name: , Length: 939, dtype: bool

In [18]:
df[df[''] == 2015]

893        1        27.0  2015.0  5381733  2537089  2844644
894        2        27.0  2015.0  1308265   614694   693571
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[47 rows x 8 columns]

In [19]:
df[df[''] == '']

13        13         9.0  1920.0   3699428  1952989  1746439
60        13        14.0  1925.0   4485144  2387609  2097535
..       ...   ...  ..    ...     ...       ...      ...      ...
858       13        22.0  2010.0  13159388  6512110  6647278
905       13        27.0  2015.0  13515271  6666690  6848581

[20 rows x 8 columns]

In [20]:
df[''] % 10 == 0

1       True
2       True
       ...
938    False
939    False
Name: , Length: 939, dtype: bool

In [22]:
df[df[''] % 10 == 0]

1          1         9.0  1920.0  2359183  1244322  1114861
2          2         9.0  1920.0   756454   381293   375161
..       ...   ...  ..    ...     ...      ...      ...      ...
891       46       22.0  2010.0  1706242   796896   909346
892       47        22.0  2010.0  1392818   683328   709490

[470 rows x 8 columns]

In [23]:
df[~(df[''] % 10 == 0)]

48         1        14.0  1925.0  2498679  1305473  1193206
49         2        14.0  1925.0   812977   408770   404207
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[469 rows x 8 columns]

In [24]:
df[df[''] % 10 != 0]

48         1        14.0  1925.0  2498679  1305473  1193206
49         2        14.0  1925.0   812977   408770   404207
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[469 rows x 8 columns]

In [25]:
df[(df[''] == 2015) & (df[''] == '')]

905       13        27.0  2015.0  13515271  6666690  6848581

In [26]:
df[(df[''] == 2010) | (df[''] == 2015)]

846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[94 rows x 8 columns]

In [27]:
df = df.rename(columns={'': 'year'})
df

              year
1          1         9.0  1920.0  2359183  1244322  1114861
2          2         9.0  1920.0   756454   381293   375161
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[939 rows x 8 columns]

In [28]:
df.query('year == 2010')

              year
846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
891       46       22.0  2010.0  1706242   796896   909346
892       47        22.0  2010.0  1392818   683328   709490

[47 rows x 8 columns]

In [29]:
df.query('year > 2010')

              year
893        1        27.0  2015.0  5381733  2537089  2844644
894        2        27.0  2015.0  1308265   614694   693571
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[47 rows x 8 columns]

In [30]:
df.query(' == ""')

              year
13        13         9.0  1920.0   3699428  1952989  1746439
60        13        14.0  1925.0   4485144  2387609  2097535
..       ...   ...  ..    ...     ...       ...      ...      ...
858       13        22.0  2010.0  13159388  6512110  6647278
905       13        27.0  2015.0  13515271  6666690  6848581

[20 rows x 8 columns]

In [31]:
df.query(' == ""')

              year
13        13         9.0  1920.0   3699428  1952989  1746439
60        13        14.0  1925.0   4485144  2387609  2097535
..       ...   ...  ..    ...     ...       ...      ...      ...
858       13        22.0  2010.0  13159388  6512110  6647278
905       13        27.0  2015.0  13515271  6666690  6848581

[20 rows x 8 columns]

In [32]:
df.query('year == 2010 or year == 2015')

              year
846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[94 rows x 8 columns]

In [33]:
df.query('year == 2010 | year == 2015')

              year
846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[94 rows x 8 columns]

In [34]:
df.query(' == "" and year == 2015')

              year
905       13        27.0  2015.0  13515271  6666690  6848581

In [35]:
df.query(' == "" & year == 2015')

              year
905       13        27.0  2015.0  13515271  6666690  6848581

In [36]:
df['year'].isin([2010])

1      False
2      False
       ...
938    False
939    False
Name: year, Length: 939, dtype: bool

In [37]:
df[df['year'].isin([2010])]

              year
846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
891       46       22.0  2010.0  1706242   796896   909346
892       47        22.0  2010.0  1392818   683328   709490

[47 rows x 8 columns]

In [38]:
df[df['year'].isin([2010, 2015])]

              year
846        1        22.0  2010.0  5506419  2603345  2903074
847        2        22.0  2010.0  1373339   646141   727198
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[94 rows x 8 columns]

In [40]:
df[''].str.contains('')

1      False
2      False
       ...
938    False
939    False
Name: , Length: 939, dtype: bool

In [41]:
df[df[''].str.contains('')]

              year
6          6         9.0  1920.0   968925  478328  490597
16        16         9.0  1920.0   724276  354775  369501
..       ...   ...  ..    ...     ...      ...     ...     ...
925       33        27.0  2015.0  1921525  922226  999299
927       35        27.0  2015.0  1404729  665008  739721

[120 rows x 8 columns]

In [42]:
df[df[''].str.startswith('')]

              year
27        27         9.0  1920.0  2587847  1344846  1243001
44        44         9.0  1920.0   860282   422708   437574
..       ...   ...  ..    ...     ...      ...      ...      ...
919       27        27.0  2015.0  8839469  4256049  4583420
936       44        27.0  2015.0  1166338   551932   614406

[40 rows x 8 columns]

In [43]:
df[df[''].str.endswith('')]

              year
1          1         9.0  1920.0  2359183  1244322  1114861
48         1        14.0  1925.0  2498679  1305473  1193206
..       ...   ...  ..    ...     ...      ...      ...      ...
846        1        22.0  2010.0  5506419  2603345  2903074
893        1        27.0  2015.0  5381733  2537089  2844644

[20 rows x 8 columns]

In [44]:
df[df['year'] == df['year'].max()]

              year
893        1        27.0  2015.0  5381733  2537089  2844644
894        2        27.0  2015.0  1308265   614694   693571
..       ...   ...  ..    ...     ...      ...      ...      ...
938       46       27.0  2015.0  1648177   773061   875116
939       47        27.0  2015.0  1433566   704619   728947

[47 rows x 8 columns]

In [45]:
df.loc[895, ['', '']]

    615584
    664010
Name: 895, dtype: object

## 08

In [46]:
import pandas as pd

In [47]:
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 10)

In [49]:
df = pd.read_excel('sample.xlsx', sheet_name='')
df

             ID
0   2020-01-04  a023             7000   8  56000
1   2020-01-05  a003              6000  10  60000
2   2020-01-05  a052              10000   7  70000
3   2020-01-06  a003            7000  10  70000
4   2020-01-07  a036              7000   2  14000
..         ...   ...     ... ..   ...     ...    ...  ..    ...
219 2020-12-26  a052                18000   4  72000
220 2020-12-28  a036                18000   3  54000
221 2020-12-30  a003              18000   4  72000
222 2020-12-30  a047             3000   3   9000
223 2020-12-31  a036              7000  10  70000

[224 rows x 9 columns]

In [52]:
df.sort_values(by='')

             ID
218 2020-12-26  a013             3000   1    3000
186 2020-11-04  a051              3000   1    3000
182 2020-11-03  a051              3000   1    3000
117 2020-08-07  a003            3000   1    3000
81  2020-06-10  a023                4000   1    4000
..         ...   ...     ... ..   ...     ...    ...  ..     ...
113 2020-07-30  a051                18000   8  144000
135 2020-08-26  a013               18000   9  162000
82  2020-06-11  a023               18000   9  162000
198 2020-11-19  a003              18000  10  180000
132 2020-08-25  a036                18000  10  180000

[224 rows x 9 columns]

In [53]:
df.sort_values(by='',ascending=False)

             ID
198 2020-11-19  a003              18000  10  180000
132 2020-08-25  a036                18000  10  180000
135 2020-08-26  a013               18000   9  162000
82  2020-06-11  a023               18000   9  162000
123 2020-08-17  a036                18000   8  144000
..         ...   ...     ... ..   ...     ...    ...  ..     ...
81  2020-06-10  a023                4000   1    4000
117 2020-08-07  a003            3000   1    3000
182 2020-11-03  a051              3000   1    3000
218 2020-12-26  a013             3000   1    3000
186 2020-11-04  a051              3000   1    3000

[224 rows x 9 columns]

In [55]:
df.sort_values(by='', ascending='True')

             ID
218 2020-12-26  a013             3000   1    3000
186 2020-11-04  a051              3000   1    3000
182 2020-11-03  a051              3000   1    3000
117 2020-08-07  a003            3000   1    3000
81  2020-06-10  a023                4000   1    4000
..         ...   ...     ... ..   ...     ...    ...  ..     ...
113 2020-07-30  a051                18000   8  144000
135 2020-08-26  a013               18000   9  162000
82  2020-06-11  a023               18000   9  162000
198 2020-11-19  a003              18000  10  180000
132 2020-08-25  a036                18000  10  180000

[224 rows x 9 columns]

In [56]:
df.sort_values(by=['',''])

             ID
14  2020-01-22  a047               4000   1    4000
9   2020-01-11  a047            7000   1    7000
175 2020-10-30  a047            3000   3    9000
222 2020-12-30  a047            3000   3    9000
24  2020-02-13  a047               8000   2   16000
..         ...   ...    ... ..   ...     ...    ...  ..     ...
223 2020-12-31  a036             7000  10   70000
68  2020-05-14  a036             10000  10  100000
103 2020-07-14  a036               18000   7  126000
123 2020-08-17  a036               18000   8  144000
132 2020-08-25  a036               18000  10  180000

[224 rows x 9 columns]

In [57]:
df.sort_values(by=['',''],ascending=[True,False])

             ID
21  2020-02-03  a047              18000   8  144000
6   2020-01-10  a047              18000   7  126000
99  2020-07-10  a047              18000   7  126000
42  2020-03-12  a047            10000   9   90000
104 2020-07-14  a047            10000   9   90000
..         ...   ...    ... ..   ...     ...    ...  ..     ...
190 2020-11-10  a036             10000   1   10000
31  2020-03-02  a036             3000   3    9000
70  2020-05-20  a036             7000   1    7000
153 2020-09-12  a036             3000   2    6000
29  2020-02-25  a036                4000   1    4000

[224 rows x 9 columns]

In [59]:
df.sort_values(by=['','',''],ascending=[False,True,False])

             ID
21  2020-02-03  a047               18000   8  144000
6   2020-01-10  a047               18000   7  126000
99  2020-07-10  a047               18000   7  126000
42  2020-03-12  a047             10000   9   90000
104 2020-07-14  a047             10000   9   90000
..         ...   ...     ... ..   ...     ...    ...  ..     ...
57  2020-04-18  a003               8000   1    8000
130 2020-08-25  a003               8000   1    8000
163 2020-10-03  a003               4000   2    8000
11  2020-01-19  a003               4000   1    4000
117 2020-08-07  a003            3000   1    3000

[224 rows x 9 columns]

In [60]:
df = pd.read_excel('sample.xlsx',sheet_name='_')
df.sort_values(by='', ascending=True)

             ID
222 2020-12-30  a047           3000   3   9000
23  2020-02-10  a047           7000   3  21000
24  2020-02-13  a047              8000   2  16000
199 2020-11-19  a047           7000   7  49000
197 2020-11-16  a047              8000   8  64000
..         ...   ...    ... ..   ...     ...   ...  ..    ...
86  2020-06-15  a036               8000   2  16000
223 2020-12-31  a036            7000  10  70000
16  2020-01-25  a036    NaN           4000   5  20000
17  2020-01-26  a003    NaN           4000   6  24000
18  2020-01-26  a013    NaN        7000   5  35000

[224 rows x 9 columns]

In [61]:
df.sort_values(by='',ascending=False)

             ID
223 2020-12-31  a036            7000  10  70000
188 2020-11-09  a036              6000   8  48000
29  2020-02-25  a036               4000   1   4000
137 2020-08-26  a036            3000   6  18000
31  2020-03-02  a036            3000   3   9000
..         ...   ...    ... ..   ...     ...   ...  ..    ...
88  2020-06-16  a047           7000   6  42000
74  2020-05-24  a047           3000   6  18000
16  2020-01-25  a036    NaN           4000   5  20000
17  2020-01-26  a003    NaN           4000   6  24000
18  2020-01-26  a013    NaN        7000   5  35000

[224 rows x 9 columns]

In [62]:
df.sort_values(by='',ascending=False, na_position='first')

             ID
16  2020-01-25  a036    NaN            4000   5  20000
17  2020-01-26  a003    NaN            4000   6  24000
18  2020-01-26  a013    NaN         7000   5  35000
223 2020-12-31  a036             7000  10  70000
188 2020-11-09  a036               6000   8  48000
..         ...   ...    ... ..   ...     ...    ...  ..    ...
79  2020-06-03  a047            10000   6  60000
180 2020-11-03  a047            7000   9  63000
157 2020-09-18  a047               4000   7  28000
88  2020-06-16  a047            7000   6  42000
74  2020-05-24  a047            3000   6  18000

[224 rows x 9 columns]

In [64]:
df_ax = pd.DataFrame({'col01':[1,5,9], 'col02':[2,4,8], 'col03':[3,6,7]}
                  ,index=['idx01', 'idx02', 'idx03'])
df_ax

       col01  col02  col03
idx01      1      2      3
idx02      5      4      6
idx03      9      8      7

In [65]:
df_ax.sort_values(by='idx01', ascending=False, axis=1)

       col03  col02  col01
idx01      3      2      1
idx02      6      4      5
idx03      7      8      9

In [66]:
df_ax.sort_values(by='col01',ascending=False, axis=0)

       col01  col02  col03
idx03      9      8      7
idx02      5      4      6
idx01      1      2      3

In [67]:
df_ax

       col01  col02  col03
idx01      1      2      3
idx02      5      4      6
idx03      9      8      7

In [68]:
df_ax.sort_values(by='col01',ascending=False)

       col01  col02  col03
idx03      9      8      7
idx02      5      4      6
idx01      1      2      3

In [70]:
df_ax

       col01  col02  col03
idx01      1      2      3
idx02      5      4      6
idx03      9      8      7

In [71]:
df_ax.sort_values(by='col01',ascending=False, inplace=True)

In [72]:
df_ax

       col01  col02  col03
idx03      9      8      7
idx02      5      4      6
idx01      1      2      3

In [73]:
df_ax = df_ax.sort_values(by='col01', ascending=True)

In [74]:
df_ax

       col01  col02  col03
idx01      1      2      3
idx02      5      4      6
idx03      9      8      7

In [75]:
df_ax.sort_index(ascending=False)

       col01  col02  col03
idx03      9      8      7
idx02      5      4      6
idx01      1      2      3

In [77]:
df_ax.sort_index(ascending=False,inplace=True,na_position='first')

In [78]:
df_ax

       col01  col02  col03
idx03      9      8      7
idx02      5      4      6
idx01      1      2      3

In [79]:
df_ax.sort_index(axis=1, ascending=False)

       col03  col02  col01
idx03      7      8      9
idx02      6      4      5
idx01      3      2      1

In [80]:
s =df_ax['col01']

In [81]:
s

idx03    9
idx02    5
idx01    1
Name: col01, dtype: int64

In [82]:
type(s)

pandas.core.series.Series

In [83]:
s.sort_values(ascending=True)

idx01    1
idx02    5
idx03    9
Name: col01, dtype: int64

In [84]:
s

idx03    9
idx02    5
idx01    1
Name: col01, dtype: int64

In [85]:
s.sort_index(ascending=True)

idx01    1
idx02    5
idx03    9
Name: col01, dtype: int64

## 09